     A*****************************************************************
     A* FILE NAME:  INVMST                                            *
     A* RELATED PGMS:  INVMNT                                         *
     A* RELATED FILES:  INVMSTL1 (LOGICAL FILE)                       *
     A* DESCRIPTION:  THIS IS THE PHYSICAL FILE INVMST. IT HAS        *
     A*           ONE RECORD FORMAT CALLED INVREC.                    *
     A*****************************************************************
     A* INVENTORY MASTER FILE -- INVMST
     A          R INVREC
     A            ITEMID        10          TEXT('INVENTORY ITEM ID')
     A            DESC          30          TEXT('ITEM DESCRIPTION')
     A            QTYOH          7  0       TEXT('QUANTITY ON HAND')
